<?xml version="1.0" ?>
<net batch="1" name="mobilenet_ssd_672x384" version="6">
	<layers>
		<layer id="0" name="data" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Mul_/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="12"/>
				<biases offset="12" size="12"/>
			</blobs>
		</layer>
		<layer id="2" name="conv1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="24" size="2592"/>
				<biases offset="2616" size="96"/>
			</blobs>
		</layer>
		<layer id="3" name="relu1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv2_1/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="24" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2712" size="864"/>
				<biases offset="3576" size="96"/>
			</blobs>
		</layer>
		<layer id="5" name="relu2_1/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv2_1/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="56" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3672" size="5376"/>
				<biases offset="9048" size="224"/>
			</blobs>
		</layer>
		<layer id="7" name="relu2_1/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv2_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="56" kernel="3,3" output="56" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9272" size="2016"/>
				<biases offset="11288" size="224"/>
			</blobs>
		</layer>
		<layer id="9" name="relu2_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv2_2/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="104" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>104</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="11512" size="23296"/>
				<biases offset="34808" size="416"/>
			</blobs>
		</layer>
		<layer id="11" name="relu2_2/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>104</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>104</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv3_1/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="104" kernel="3,3" output="104" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>104</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>104</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="35224" size="3744"/>
				<biases offset="38968" size="416"/>
			</blobs>
		</layer>
		<layer id="13" name="relu3_1/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>104</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>104</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv3_1/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="120" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>104</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="39384" size="49920"/>
				<biases offset="89304" size="480"/>
			</blobs>
		</layer>
		<layer id="15" name="relu3_1/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv3_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="120" kernel="3,3" output="120" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="89784" size="4320"/>
				<biases offset="94104" size="480"/>
			</blobs>
		</layer>
		<layer id="17" name="relu3_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv3_2/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="94584" size="111360"/>
				<biases offset="205944" size="928"/>
			</blobs>
		</layer>
		<layer id="19" name="relu3_2/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv4_1/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="232" kernel="3,3" output="232" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="206872" size="8352"/>
				<biases offset="215224" size="928"/>
			</blobs>
		</layer>
		<layer id="21" name="relu4_1/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv4_1/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="216152" size="215296"/>
				<biases offset="431448" size="928"/>
			</blobs>
		</layer>
		<layer id="23" name="relu4_1/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv4_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="232" kernel="3,3" output="232" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="432376" size="8352"/>
				<biases offset="440728" size="928"/>
			</blobs>
		</layer>
		<layer id="25" name="relu4_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv4_2/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="360" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>360</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="441656" size="334080"/>
				<biases offset="775736" size="1440"/>
			</blobs>
		</layer>
		<layer id="27" name="relu4_2/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>360</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>360</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="conv5_1/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="360" kernel="3,3" output="360" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>360</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>360</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="777176" size="12960"/>
				<biases offset="790136" size="1440"/>
			</blobs>
		</layer>
		<layer id="29" name="relu5_1/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>360</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>360</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv5_1/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="328" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>360</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="791576" size="472320"/>
				<biases offset="1263896" size="1312"/>
			</blobs>
		</layer>
		<layer id="31" name="relu5_1/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv5_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="328" kernel="3,3" output="328" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1265208" size="11808"/>
				<biases offset="1277016" size="1312"/>
			</blobs>
		</layer>
		<layer id="33" name="relu5_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="conv5_2/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="304" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>304</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1278328" size="398848"/>
				<biases offset="1677176" size="1216"/>
			</blobs>
		</layer>
		<layer id="35" name="relu5_2/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>304</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>304</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv5_3/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="304" kernel="3,3" output="304" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>304</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>304</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1678392" size="10944"/>
				<biases offset="1689336" size="1216"/>
			</blobs>
		</layer>
		<layer id="37" name="relu5_3/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>304</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>304</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="conv5_3/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="248" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>304</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>248</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1690552" size="301568"/>
				<biases offset="1992120" size="992"/>
			</blobs>
		</layer>
		<layer id="39" name="relu5_3/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>248</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>248</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv5_4/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="248" kernel="3,3" output="248" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>248</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>248</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1993112" size="8928"/>
				<biases offset="2002040" size="992"/>
			</blobs>
		</layer>
		<layer id="41" name="relu5_4/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>248</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>248</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="conv5_4/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="224" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>248</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>224</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2003032" size="222208"/>
				<biases offset="2225240" size="896"/>
			</blobs>
		</layer>
		<layer id="43" name="relu5_4/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>224</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="conv5_5/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="224" kernel="3,3" output="224" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>224</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2226136" size="8064"/>
				<biases offset="2234200" size="896"/>
			</blobs>
		</layer>
		<layer id="45" name="relu5_5/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>224</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="conv5_5/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="184" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>184</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2235096" size="164864"/>
				<biases offset="2399960" size="736"/>
			</blobs>
		</layer>
		<layer id="47" name="relu5_5/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>184</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="conv4_3_0_norm_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2400696" size="105984"/>
				<biases offset="2506680" size="64"/>
			</blobs>
		</layer>
		<layer id="49" name="conv4_3_0_norm_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>42</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="conv4_3_0_norm_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>42</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16128</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="conv4_3_norm_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2506744" size="105984"/>
				<biases offset="2612728" size="64"/>
			</blobs>
		</layer>
		<layer id="52" name="conv4_3_norm_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>42</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="conv4_3_norm_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>42</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16128</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="conv5_6/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="184" kernel="3,3" output="184" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>184</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2612792" size="6624"/>
				<biases offset="2619416" size="736"/>
			</blobs>
		</layer>
		<layer id="55" name="relu5_6/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>184</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="conv5_6/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="224" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>224</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2620152" size="164864"/>
				<biases offset="2785016" size="896"/>
			</blobs>
		</layer>
		<layer id="57" name="relu5_6/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>224</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="conv6/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="224" kernel="3,3" output="224" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>224</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2785912" size="8064"/>
				<biases offset="2793976" size="896"/>
			</blobs>
		</layer>
		<layer id="59" name="relu6/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>224</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="conv6/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2794872" size="114688"/>
				<biases offset="2909560" size="512"/>
			</blobs>
		</layer>
		<layer id="61" name="relu6/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="fc7_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2910072" size="110592"/>
				<biases offset="3020664" size="96"/>
			</blobs>
		</layer>
		<layer id="63" name="fc7_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>12</dim>
					<dim>21</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="fc7_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>21</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>6048</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv6_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="120" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3020760" size="61440"/>
				<biases offset="3082200" size="480"/>
			</blobs>
		</layer>
		<layer id="66" name="relu6_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="conv6_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="120" kernel="3,3" output="120" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3082680" size="4320"/>
				<biases offset="3087000" size="480"/>
			</blobs>
		</layer>
		<layer id="68" name="relu6_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="conv6_2_new" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="152" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>152</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3087480" size="72960"/>
				<biases offset="3160440" size="608"/>
			</blobs>
		</layer>
		<layer id="70" name="relu6_2" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>152</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>152</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="conv6_2_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>152</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3161048" size="131328"/>
				<biases offset="3292376" size="96"/>
			</blobs>
		</layer>
		<layer id="72" name="conv6_2_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>6</dim>
					<dim>11</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="conv6_2_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>11</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1584</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="conv7_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="112" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>152</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3292472" size="68096"/>
				<biases offset="3360568" size="448"/>
			</blobs>
		</layer>
		<layer id="75" name="relu7_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="conv7_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="112" kernel="3,3" output="112" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3361016" size="4032"/>
				<biases offset="3365048" size="448"/>
			</blobs>
		</layer>
		<layer id="77" name="relu7_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="conv7_2_new" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="168" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>168</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3365496" size="75264"/>
				<biases offset="3440760" size="672"/>
			</blobs>
		</layer>
		<layer id="79" name="relu7_2" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>168</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>168</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv7_2_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>168</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3441432" size="145152"/>
				<biases offset="3586584" size="96"/>
			</blobs>
		</layer>
		<layer id="81" name="conv7_2_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>6</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="conv7_2_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>6</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="conv8_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="120" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>168</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3586680" size="80640"/>
				<biases offset="3667320" size="480"/>
			</blobs>
		</layer>
		<layer id="84" name="relu8_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="conv8_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="120" kernel="3,3" output="120" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3667800" size="4320"/>
				<biases offset="3672120" size="480"/>
			</blobs>
		</layer>
		<layer id="86" name="relu8_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="conv8_2_new" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="200" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>200</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3672600" size="96000"/>
				<biases offset="3768600" size="800"/>
			</blobs>
		</layer>
		<layer id="88" name="relu8_2" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="conv8_2_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3769400" size="115200"/>
				<biases offset="3884600" size="64"/>
			</blobs>
		</layer>
		<layer id="90" name="conv8_2_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="conv8_2_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="conv9_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3884664" size="51200"/>
				<biases offset="3935864" size="256"/>
			</blobs>
		</layer>
		<layer id="93" name="relu9_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="conv9_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3936120" size="2304"/>
				<biases offset="3938424" size="256"/>
			</blobs>
		</layer>
		<layer id="95" name="relu9_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="conv9_2_new" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3938680" size="32768"/>
				<biases offset="3971448" size="512"/>
			</blobs>
		</layer>
		<layer id="97" name="relu9_2" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="conv9_2_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3971960" size="73728"/>
				<biases offset="4045688" size="64"/>
			</blobs>
		</layer>
		<layer id="99" name="conv9_2_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="conv9_2_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="mbox_loc" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16128</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>6048</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1584</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>432</dim>
				</port>
				<port id="5">
					<dim>1</dim>
					<dim>96</dim>
				</port>
				<port id="6">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="7">
					<dim>1</dim>
					<dim>40448</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="conv5_5/sep/reduce" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>184</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4045752" size="11776"/>
				<biases offset="4057528" size="64"/>
			</blobs>
		</layer>
		<layer id="103" name="conv5_5/sep/reduced/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="pre_conv4_3_0_norm_mbox_conf_64" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4057592" size="9216"/>
				<biases offset="4066808" size="64"/>
			</blobs>
		</layer>
		<layer id="105" name="pre_conv4_3_0_norm_mbox_conf/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="conv4_3_0_norm_mbox_conf_64" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4066872" size="4608"/>
				<biases offset="4071480" size="32"/>
			</blobs>
		</layer>
		<layer id="107" name="conv4_3_0_norm_mbox_conf_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>42</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="conv4_3_0_norm_mbox_conf_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>42</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8064</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="pre_conv4_3_norm_mbox_conf_64" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4071512" size="9216"/>
				<biases offset="4080728" size="64"/>
			</blobs>
		</layer>
		<layer id="110" name="pre_conv4_3_norm_mbox_conf/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="conv4_3_norm_mbox_conf_64" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4080792" size="4608"/>
				<biases offset="4085400" size="32"/>
			</blobs>
